<?php

return [
    0 => 'Операция не удалась',
    1 => 'Операция выполнена успешно',
    999 => 'Ошибка сети, попробуйте позже',
    1000 => 'Ошибка параметра',
    1001 => 'Ошибка подписи',
    1002 => 'Время ожидания запроса истекло',
    1003 => 'Системный параметр не найден',
    1004 => 'Слишком частые операции, попробуйте позже.',

    // Пользователь
    2000 => 'Сессия входа истекла, пожалуйста, войдите снова',
    2001 => 'Имя пользователя не может быть пустым',
    2002 => 'Имя пользователя может содержать только буквы и цифры',
    2003 => 'Пароль не может быть пустым',
    2004 => 'Пароль может содержать только буквы и цифры',
    2005 => 'Пароль должен быть длиной от 6 до 20 символов',
    2006 => 'Пароли не совпадают',
    2007 => 'Пользователь уже существует, введите другое имя',
    2008 => 'Пользователь не существует',
    2009 => 'Неверный пароль',
    2010 => 'Аккаунт заморожен',
    2011 => 'Новый пароль совпадает со старым',
    2012 => 'Никнейм уже существует, выберите другой',
    2013 => 'Вы можете отправлять до пяти отзывов в день',
    2014 => 'Заголовок не может быть пустым',
    2015 => 'Содержимое не может быть пустым',
    2016 => 'Заголовок не может превышать 100 символов',
    2017 => 'Содержимое не может превышать 255 символов',
    2018 => 'Никнейм уже существует, выберите другой',
    2019 => 'Имя пользователя должно быть от 6 до 20 символов',
    2020 => 'Выберите проблемное видео',
    2021 => 'Неверный код приглашения',
    2022 => 'Код активации не может быть пустым',
    2023 => 'Код активации не существует',
    2024 => 'Код активации уже использован',
    2025 => 'Вы уже активировали этот набор кодов',
    2026 => 'Код обмена истёк',

    // Видео
    3001 => 'Видео не существует',
    3002 => 'Видео удалено',
    3003 => 'Актер не найден',
    3004 => 'Доступ к видео только для VIP',
    3005 => 'Автор не найден',
    3006 => 'Отзыв не найден или удален',

    // Пополнение
    4001 => 'Пакет не существует',
    4002 => 'Нет подходящего канала оплаты',
    4003 => 'Канал оплаты занят, попробуйте другой',
    4004 => 'Вы можете выполнять операцию раз в 30 секунд, попробуйте позже',
    4005 => 'Канал оплаты не существует',
    4006 => 'Не удалось создать заказ, попробуйте позже',

    // Сериал
    5001 => 'Сериал не существует',
    5002 => 'Сериал удален',
    5003 => 'Недостаточно алмазов',
    5004 => 'Не удалось обновить баланс алмазов',
    5005 => 'Не удалось создать запись о покупке сериала',
    5006 => 'Сериал уже куплен',
    5007 => 'Пользователь не купил сериал',
    5008 => 'Для этого видео требуется покупка сериала',

    // Покупка видео
    6001 => 'Недостаточно очков',
    6002 => 'Не удалось обновить баланс очков',
    6003 => 'Не удалось создать запись о покупке видео',
    6004 => 'Видео уже куплено',
    6005 => 'Это видео бесплатное',
    6007 => 'Пользователь не купил это видео',
    6008 => 'Пользователь не купил это видео или не является VIP',

    // VIP
    7001 => 'VIP истек',

    // Оценка
    8001 => 'Видео или отзыв не существует',
    8002 => 'Оценка должна быть от 1 до 5',
];
