<?php

return [
    0 => 'การดำเนินการล้มเหลว',
    1 => 'ดำเนินการสำเร็จ',
    999 => 'ข้อผิดพลาดของเครือข่าย โปรดลองอีกครั้งภายหลัง',
    1000 => 'พารามิเตอร์ผิดพลาด',
    1001 => 'ลายเซ็นไม่ถูกต้อง',
    1002 => 'คำขอหมดเวลา',
    1003 => 'ไม่พบพารามิเตอร์ระบบ',
    1004 => 'ดำเนินการบ่อยเกินไป กรุณาลองใหม่ภายหลัง',

    // ผู้ใช้
    2000 => 'การเข้าสู่ระบบหมดอายุ โปรดเข้าสู่ระบบอีกครั้ง',
    2001 => 'ชื่อผู้ใช้ต้องไม่เว้นว่าง',
    2002 => 'ชื่อผู้ใช้สามารถใช้ได้เฉพาะตัวอักษรและตัวเลข',
    2003 => 'รหัสผ่านต้องไม่เว้นว่าง',
    2004 => 'รหัสผ่านสามารถใช้ได้เฉพาะตัวอักษรและตัวเลข',
    2005 => 'รหัสผ่านต้องมีความยาว 6–20 ตัวอักษร',
    2006 => 'รหัสผ่านไม่ตรงกัน',
    2007 => 'ผู้ใช้นี้มีอยู่แล้ว โปรดใช้ชื่อผู้ใช้อื่น',
    2008 => 'ไม่พบผู้ใช้',
    2009 => 'รหัสผ่านไม่ถูกต้อง',
    2010 => 'บัญชีถูกระงับ',
    2011 => 'รหัสผ่านใหม่เหมือนกับรหัสผ่านเก่า',
    2012 => 'ชื่อเล่นนี้มีอยู่แล้ว โปรดใช้ชื่ออื่น',
    2013 => 'คุณสามารถส่งข้อเสนอแนะได้สูงสุด 5 ครั้งต่อวัน',
    2014 => 'หัวเรื่องต้องไม่เว้นว่าง',
    2015 => 'เนื้อหาต้องไม่เว้นว่าง',
    2016 => 'หัวเรื่องต้องไม่เกิน 100 ตัวอักษร',
    2017 => 'เนื้อหาต้องไม่เกิน 255 ตัวอักษร',
    2018 => 'ชื่อเล่นนี้มีอยู่แล้ว โปรดใช้ชื่ออื่น',
    2019 => 'ชื่อผู้ใช้ต้องมีความยาว 6–20 ตัวอักษร',
    2020 => 'โปรดเลือกวิดีโอที่มีปัญหา',
    2021 => 'รหัสเชิญไม่ถูกต้อง',
    2022 => 'รหัสแลกไม่สามารถเว้นว่างได้',
    2023 => 'ไม่พบรหัสแลก',
    2024 => 'รหัสแลกถูกใช้ไปแล้ว',
    2025 => 'คุณได้แลกรหัสชุดนี้ไปแล้ว',
    2026 => 'รหัสแลกเปลี่ยนหมดอายุแล้ว',

    // วิดีโอ
    3001 => 'ไม่พบวิดีโอ',
    3002 => 'วิดีโอถูกลบแล้ว',
    3003 => 'ไม่พบนักแสดง',
    3004 => 'วิดีโอนี้สำหรับสมาชิก VIP เท่านั้น',
    3005 => 'ไม่พบผู้เขียน',
    3006 => 'ไม่พบรีวิวหรือรีวิวถูกลบแล้ว',

    // เติมเงิน
    4001 => 'ไม่พบแพ็กเกจ',
    4002 => 'ไม่มีช่องทางการชำระเงินที่ใช้ได้',
    4003 => 'ช่องทางการชำระเงินไม่ว่าง โปรดลองช่องทางอื่น',
    4004 => 'คุณสามารถดำเนินการได้ทุก ๆ 30 วินาที โปรดลองอีกครั้ง',
    4005 => 'ไม่พบช่องทางการชำระเงิน',
    4006 => 'การสร้างคำสั่งซื้อไม่สำเร็จ โปรดลองอีกครั้ง',

    // ซีรีส์
    5001 => 'ไม่พบซีรีส์',
    5002 => 'ซีรีส์ถูกลบแล้ว',
    5003 => 'เพชรไม่เพียงพอ',
    5004 => 'อัปเดตยอดเพชรไม่สำเร็จ',
    5005 => 'สร้างประวัติการซื้อซีรีส์ไม่สำเร็จ',
    5006 => 'คุณได้ซื้อซีรีส์นี้แล้ว',
    5007 => 'ผู้ใช้นี้ยังไม่ได้ซื้อซีรีส์',
    5008 => 'วิดีโอนี้ต้องซื้อซีรีส์ก่อน',

    // การซื้อวิดีโอ
    6001 => 'คะแนนไม่เพียงพอ',
    6002 => 'อัปเดตยอดคะแนนไม่สำเร็จ',
    6003 => 'สร้างประวัติการซื้อวิดีโอไม่สำเร็จ',
    6004 => 'คุณได้ซื้อวิดีโอนี้แล้ว',
    6005 => 'วิดีโอนี้ฟรี',
    6007 => 'ผู้ใช้นี้ยังไม่ได้ซื้อวิดีโอ',
    6008 => 'ผู้ใช้นี้ยังไม่ได้ซื้อวิดีโอนี้หรือไม่ใช่ VIP',

    // VIP
    7001 => 'VIP หมดอายุแล้ว',

    // การให้คะแนน
    8001 => 'ไม่พบวิดีโอหรือรีวิว',
    8002 => 'การให้คะแนนต้องอยู่ระหว่าง 1 ถึง 5',
];
