<?php


return [
    0 => '操作失败',
    1 => '操作成功',
    999 => '网络异常，请稍候再试',
    1000 => '参数错误',
    1001 => '签名错误',
    1002 => '请求超时',
    1003 => '未找到系统参数',
    1008 => '验证码不存在或失效',
    1009 => '验证码发送失败',
    1010 => '发送太频繁，请稍后再试',


    //用户
    2000 => 'Token已过期或无效Token',
    2001 => '用户名不能为空',
    2002 => '用户名只能为英文和数字',
    2003 => '密码不能为空',
    2004 => '密码只能为英文和数字',
    2005 => '密码需在6-20个字符之间',
    2006 => '两次输入密码不一致',
    2007 => '用户已存在，请重新输入用户名',
    2008 => '用户不存在',
    2009 => '密码不正确',
    2010 => '账号已被冻结',
    2011 => '新密码与原密码相同',
    2012 => '昵称已存在，請重新輸入',
    2013 => '一天最多提交五条反馈',
    2015 => '内容不能为空',
    2016 => '联系方式不能超过100个字符',
    2017 => '内容不能超过255个字符',
    2019 => '昵称已存在，請重新輸入',
    2020 => '用户名需在6-20个字符之间',
    2021 => '兑换码不能为空',
    2022 => '兑换码不存在',
    2023 => '兑换码已经使用',
    2024 => '您已经兑换过同一批次的兑换码',
    2025 => '邮箱不能为空',
    2026 => '邮箱格式不正确',
    2027 => '昵称不能为空',
    2028 => '昵称只能为英文和数字',
    2029 => '邮箱已被使用，请重新输入',
    2030 => '请选择满意度',
    2031 => '无效的满意度',

    3001 => '漫画不存在',
    3002 => '漫画已经下架',

    4001 => '章节不存在',
    4002 => '章节已经下架',
    4003 => '书币不足，请先充值',
    4004 => '请先购买此章节',

    //充值
    5001 => '充值商品不存在',
    5002 => '暂无合适的付款渠道',
    5003 => '当前支付渠道繁忙，请更换其他渠道',
    5004 => '20秒内只能操作一次，请稍后再试'
];
